#define  _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>
#include <Windows.h>

int main()
{
	int n = 9;
	float *p = (float *)&n;
	printf("n的值为：%d\n", n);//9
	//以浮点型存储去取数据
	//9的二进制为0000 0000 0000 0000 0000 0000 0000 1001
	//去掉符号位0，后8位指数位都是0，E全为0的情况，取出来就是趋于0的一个数
	printf("*p的值为：%f\n", *p);//0.000000

	*p = 9.0;
	//把9.0的二进制以浮点型存入*p
	//1001.0 -> 1.0010*2^3
	//0 1000 0010 0010 0000 0000 0000 0000 000（浮点型存储）
	printf("n的值为：%d\n", n);//以整数的存储去读这个数得到：1091567616
	printf("*p的值为：%f\n", *p);//以浮点数的存储去读这个数得到：9.0
	system("pause");
	return 0;
}